examples/of2206/kEpsilon/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{       

    inlet
    {
		type			zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    ground      
    {
        type            zeroGradient;
    }
    
    building      
    {
        type            zeroGradient;
    }

    surroundings      
    {
        type            zeroGradient;
    }

    #include "include/sideAndTopPatches"

}

// ************************************************************************* //
