examples/of2206/kEpsilon/constant/turbulenceProperties
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{
    RASModel            kEpsilonABL;//kEpsilonABL; kEpsilon;

    turbulence          on;

    printCoeffs         on;
   

    kEpsilonABLCoeffs
    {
        #include       "../0/include/ABLConditions"

        // Cmu         0.09;
        C1          1.44;
        C2          1.92;
        sigmaEps    1.11; // Original value:1.44 (Hargreaves & Wright, 2007)
        sigmak      1.0;
    }
    
    
    kEpsilonCoeffs
    {
        #include       "../0/include/ABLConditions"
        
        // Cmu         0.09;
        C1          1.44;
        C2          1.92;
        sigmaEps    1.11; // Original value:1.44 (Hargreaves & Wright, 2007)
        sigmak      1.0;
    }

    // realizableKECoeffs
    // {
    //     A0          4.04; //Fluent Default. Default OF = 4.0;
    //     C2          1.9;
    //     sigmak      1.0;
    //     sigmaEps    1.2;
    // }

    //  RNGkEpsilonCoeffs
    // {
    //     #include       "../0/include/ABLConditions"
    //     // Cmu         0.0845;
    //     C1          1.42;
    //     C2          1.68;
    //     C3          -0.33;
    //     sigmak      0.71942;
    //     sigmaEps    0.71942;
    //     eta0        4.38;
    //     beta        0.012;
    // }

    // https://cpp.openfoam.org/v7/classFoam_1_1RASModels_1_1RNGkEpsilon.html


}

// ************************************************************************* //
